{
    "about": {
      "title": ">About Me",
      "over1": "-overview:",
      "over11": "I am a versatile software developer. I work with multiple programming languages such as java, c, c++, python and php.",
      "over12": "currently, I focus on web-development, mostly on back-end using Laravel.",
      "over13": "additionally, I have the skills to work as a full-stack developer.",

      "over2": "-my education: ",
      "over21": "jagiellonian university | 2021-2024:",
      "over22": "bachelor’s degree in digital information processing",
      "over23": "full-time degree programme | (finished)",
      "over24": "jagiellonian university | 2022-2025:",
      "over25": "pursuing bachelor’s degree in applied computer science",
      "over26": "full-time degree programme | (in-progress)",
      "over27": "jagiellonian language centre | 2023",
      "over28": "certificate in advanced english c1",

      "over3": "-my work experience:",
      "over31": "bartender / waiter | 1/4 fte | 2022 to 2024",
      "over32": "hotel ascot premium, poland, cracow",

      "over4": "-my technical experience:",
      "over41": "experienced in working with linux and macos (terminals).",
      "over42": "experienced in working with github, figma, jetbrains suite, affinity photo 2, blender, vsc, vs, docker",

      "over5": "-my programming experience:",
      "over51": "2-3 years | programming languages:",
      "over52": "multiple projects posted on github",
      "over53": "3 years | Web development:",

      "over6": "-my passions:",
      "over61": "I love working out and playing tennis. I believe that sport is an essential part of what makes as humans. ",
      "over62": "I also love new technologies and everything about it. I try my best to stay on top of news regarding the newest tech.",
      "over63": "Oh, and also I love working with carbon fiber. It's my favorite composite",

      "over7": "-my photo:"

    },

    "my-project": {
      "over1": ">My projects"
    },
    "project1": {
      "over1": "Matematyczna Linia | Laravel",
      "over2": "-project overview:",
      "over3": "Matematyczna Linia is my most ambitious project yet. It is a comprehensive web platform designed for managing tutoring sessions and educational materials in mathematics. This project started as a bachelor’s thesis and is now being developed as a fully-fledged business platform, providing users with a modern tool for learning and organizing lessons.",
      "over4": "-features",
      "over5": "The platform offers advanced features such as managing educational materials, adding and assigning tasks to students, scheduling lessons, creating and customizing user profiles. Users can browse educational resources, filter them by difficulty level and topic, and collaborate with tutors in an intuitive and transparent way.",
      "over6": "-outcomes and future prospects:",
      "over7": "Matematyczna Linia is already operating as an independent service and is evolving with new features in mind, such as user-to-user chat, a more advanced mathematical editor, and automatic scheduling. This project demonstrates my skills in the full cycle of web application development - from concept to deployment.",
      "over8": "-Technologies and tools:",
      "over9": "database: mariadb, managed via phpmyadmin"

    },
    "project2": {
      "over1": "Github analysis | Python"
    },
    "project3": {
      "over1": "Portfolio"
    },

    "my-education": {
      "over1": ">My education"
    },

    "my-contact-info": {
      "over1": ">my contact"
    }
}